## Import libraries

In [1]:
import pandas as pd
import numpy as np

## Read in data from CSV file

In [2]:
df = pd.read_csv('../input/wikipedia_edits.csv.zip')

In [3]:
len(df)

789343

In [4]:
df.head()

,title,parentid,revid,timestamp,user,userid,size,recipient,year,rank,country,career,tied
0,50_Cent,858765697,858858564,2018-09-10T02:52:25Z,ProspectIV,33893830.0,132452,50 Cent,2006,8,United States,Musician,0
1,50_Cent,858673799,858765697,2018-09-09T13:11:00Z,ProspectIV,33893830.0,132476,50 Cent,2006,8,United States,Musician,0
2,50_Cent,858673121,858673799,2018-09-08T21:46:42Z,ProspectIV,33893830.0,132444,50 Cent,2006,8,United States,Musician,0
3,50_Cent,858673016,858673121,2018-09-08T21:39:37Z,ProspectIV,33893830.0,132345,50 Cent,2006,8,United States,Musician,0
4,50_Cent,858469414,858673016,2018-09-08T21:38:24Z,ProspectIV,33893830.0,132345,50 Cent,2006,8,United States,Musician,0

In [5]:
df.tail()

,title,parentid,revid,timestamp,user,userid,size,recipient,year,rank,country,career,tied
789338,U2,383222001,74600,2002-02-25T15:43:11Z,Conversion script,0.0,406,U2,2011,4,Republic of Ireland,Musicians,0
789339,U2,383221849,383222001,2001-12-19T22:47:40Z,144.132.75.xxx,0.0,402,U2,2011,4,Republic of Ireland,Musicians,0
789340,U2,292008,292009,2001-12-12T08:28:48Z,202.161.127.xxx,0.0,654,U2,2011,4,Republic of Ireland,Musicians,0
789341,U2,292007,292008,2001-12-03T17:45:09Z,193.133.134.xxx,0.0,409,U2,2011,4,Republic of Ireland,Musicians,0
789342,U2,0,292007,2001-08-08T12:04:31Z,Rrees,32609845.0,395,U2,2011,4,Republic of Ireland,Musicians,0

In [7]:
len(pd.unique(df['revid']))

789343

In [8]:
len(pd.unique(df['title']))

82

In [9]:
len(pd.unique(df['user']))

204528

In [11]:
len(pd.unique(df['userid']))

69829

In [12]:
df['user'].value_counts().head()

GabeMc         4584
Popeye191      4560
SNUGGUMS       4493
Andreasegde    4250
ClueBot NG     2940
Name: user, dtype: int64

In [13]:
df['userid'].value_counts().head()

0.0           243105
11243047.0      4584
6138283.0       4560
19269270.0      4493
1228034.0       4250
Name: userid, dtype: int64

In [18]:
n_users = len(pd.unique(df['user']))
n_anon_users = len(pd.unique(df.loc[df['userid']==0, 'user']))
pct_anon = n_anon_users/n_users
'Out of %d users, %d (%.2f%%) are anonymous.' % (n_users, n_anon_users, pct_anon*100)

'Out of 204528 users, 134689 (65.85%) are anonymous.'

In [19]:
pct_anon

0.658535750606274

In [20]:
df[df['userid']==0].head()

,title,parentid,revid,timestamp,user,userid,size,recipient,year,rank,country,career,tied
2643,50_Cent,219167675,219176128,2008-06-13T22:43:27Z,209.161.4.106,0.0,48386,50 Cent,2006,8,United States,Musician,0
2645,50_Cent,219161723,219167119,2008-06-13T21:46:42Z,65.78.203.162,0.0,49406,50 Cent,2006,8,United States,Musician,0
2649,50_Cent,219119959,219120271,2008-06-13T17:44:54Z,70.109.117.173,0.0,613,50 Cent,2006,8,United States,Musician,0
2650,50_Cent,219112543,219119959,2008-06-13T17:43:22Z,70.109.117.173,0.0,49436,50 Cent,2006,8,United States,Musician,0
2652,50_Cent,219111996,219112512,2008-06-13T17:00:52Z,75.3.141.196,0.0,49427,50 Cent,2006,8,United States,Musician,0

In [21]:
df['title'].value_counts().head(5)

Roger_Federer     24641
Britney_Spears    24640
The_Beatles       23342
Beyonce           20811
Eminem            19899
Name: title, dtype: int64

In [22]:
df['title'].value_counts().tail(5)

Kylie_Jenner       3056
Judy_Sheindlin     2762
Phil_McGraw        2638
Paula_Deen         2563
James_Patterson    2543
Name: title, dtype: int64